{
  "backend/main.mo": "Motoko canister that stores timestamped float readings, supports adding and querying readings, and exposes a simple hello endpoint.",
  "feature_evidence.json": "Feature evidence document mapping feature requests to impacted files, components, and test IDs for runtime config loader updates and frontend redeploy.",
  "frontend-file-summaries.txt": "Prewritten summaries of all major frontend files including components, hooks, utilities, styling, and config loader behavior.",
  "frontend/DEPLOY_FRONTEND_ONLY.md": "Guide outlining the clean rebuild and redeploy steps needed to ship updated frontend bundles using the latest runtime configuration loader.",
  "frontend/index.css": "Tailwind-based global styles defining color tokens, light/dark mode variables, and base visual theme settings.",
  "frontend/index.html": "HTML entrypoint with deploy marker and optional hook for injecting CANISTER_ID_BACKEND at runtime.",
  "frontend/public/env.json": "Static environment file providing blank CANISTER_ID_BACKEND and backend_canister_id fields for runtime resolution.",
  "frontend/src/App.tsx": "Main React app rendering authentication controls, logging instructions, latest reading card, and readings table with manual and automatic refresh.",
  "frontend/src/components/HttpLoggingInstructionsCard.tsx": "Component that resolves backend canister ID at runtime and displays HTTP logging URLs with loading, error, and copy-to-clipboard states.",
  "frontend/src/hooks/useActor.ts": "React Query hook that initializes an authenticated or anonymous backend actor and invalidates dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity authentication, handling identity loading, login, logout, and status tracking using AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for polling all readings and the latest reading from the backend actor at 3‑second intervals.",
  "frontend/src/index.css": "Configures Tailwind base styles and defines a large set of theme color variables for light and dark modes using OKLCH values.",
  "frontend/src/lib/format.ts": "Utility functions for formatting numbers and converting bigint nanosecond timestamps into human‑readable date/time strings.",
  "frontend/src/lib/runtimeConfig.ts": "Resolves the backend canister ID through multiple fallbacks (env vars, window, session cache, env.json) with caching and graceful failure handling.",
  "frontend/src/main.tsx": "Entry point that mounts the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/tailwind.config.js": "Tailwind configuration extending fonts, colors, container settings, border radii, shadows, and animations using CSS variables.",
  "project_state.json": "Describes the project's state, issues, and required features, focusing on fixing env.json backend canister ID resolution and redeploying the frontend."
}