{
  "backend/main.mo": "Defines a Motoko actor that stores timestamped readings, supports adding and retrieving readings, builds DTO responses, and includes a simple greeting endpoint.",
  "feature_evidence.json": "Feature evidence report listing configuration‑related frontend fixes, associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of key frontend components, hooks, utilities, and configuration files.",
  "frontend/index.css": "Global Tailwind-based styles defining OKLCH color variables and light/dark mode theming.",
  "frontend/index.html": "Base HTML entry point with optional runtime hook for injecting the backend canister ID.",
  "frontend/public/env.json": "Static runtime configuration file containing a placeholder backend canister ID.",
  "frontend/src/App.tsx": "Main React app with authentication controls, configuration card, latest reading display, and readings table with refresh logic.",
  "frontend/src/components/HttpLoggingInstructionsCard.tsx": "UI card that resolves the backend canister ID, shows HTTP endpoints, handles loading and configuration failure states, and supports copying URLs.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates an authenticated or anonymous actor using runtime config and refreshes dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication, creating AuthClient instances and exposing login state and identity.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks to poll the backend actor for all readings or the latest reading.",
  "frontend/src/index.css": "Tailwind CSS base file defining light/dark theme variables and global styles.",
  "frontend/src/lib/format.ts": "Utility functions for formatting numeric values and converting bigint timestamps to readable dates.",
  "frontend/src/lib/runtimeConfig.ts": "Resolves the backend canister ID using a prioritized fallback chain with caching and optional env.json loading.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider wrappers.",
  "frontend/tailwind.config.js": "Tailwind configuration enabling theming, plugins, and custom color/typography extensions.",
  "project_state.json": "Project metadata describing current architecture, issues, and feature requirements related to backend canister ID resolution."
}