{
  "backend/main.mo": "Motoko actor storing timestamped readings with auto-increment IDs and providing add, list, latest, and DTO conversion utilities plus a simple hello endpoint.",
  "feature_evidence.json": "Empty feature evidence report structure with a features array.",
  "frontend-file-summaries.txt": "Prewritten summaries describing major frontend files and their roles in the app.",
  "frontend/index.css": "Tailwind base styles defining color tokens and themes for light and dark modes.",
  "frontend/index.html": "HTML entry point that mounts the React app and loads main.tsx.",
  "frontend/src/App.tsx": "Main React app layout with identity login, latest reading display, readings table, manual refresh, and HTTP instructions card.",
  "frontend/src/components/HttpLoggingInstructionsCard.tsx": "Card component showing backend canister HTTP endpoints with copy buttons and status alerts.",
  "frontend/src/hooks/useActor.ts": "React hook creating an authenticated or anonymous backend actor and invalidating queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and hooks managing Internet Identity login, state persistence, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks polling backend for all readings and the latest reading every 3 seconds.",
  "frontend/src/index.css": "Defines Tailwind layers and extensive OKLCH CSS variables for light and dark themes, applying base styles and global background/foreground settings.",
  "frontend/src/lib/format.ts": "Provides helpers to format numbers and convert bigint nanosecond timestamps into human‑readable date strings.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/tailwind.config.js": "Tailwind configuration extending fonts, colors mapped to CSS variables, container settings, animations, and plugin usage.",
  "project_state.json": "Project metadata describing state, issues, and notes about frontend‑backend canister ID linkage requirements."
}