{
  "backend/main.mo": "Motoko actor storing sequential readings with add, list, latest, and simple DTO helpers plus a hello endpoint.",
  "backend/migration.mo": "Migration module passing through readings and nextId unchanged from old to new actor state.",
  "feature_evidence.json": "Feature evidence report describing a frontend update to show the new /status endpoint and its related files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries of all frontend files describing components, hooks, utilities, config, and deployment notes.",
  "frontend/DEPLOY_FRONTEND_ONLY.md": "Guide for performing a clean frontend-only rebuild and redeploy with env.json considerations.",
  "frontend/index.css": "Global Tailwind-based theme defining color tokens and dark mode variables.",
  "frontend/index.html": "HTML entry point loading the frontend bundle with optional runtime canister ID injection.",
  "frontend/public/env.json": "Fallback runtime config file containing backend canister ID fields.",
  "frontend/src/App.tsx": "Main React app showing login controls, HTTP instructions card, latest reading, and full readings table with refresh actions.",
  "frontend/src/components/HttpLoggingInstructionsCard.tsx": "Component resolving backend canister ID and displaying log, readings, data, and status HTTP URLs with copy and open controls plus error handling.",
  "frontend/src/hooks/useActor.ts": "React Query hook creating authenticated or anonymous backend actors and invalidating dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an auth context and provider for Internet Identity, handling login, stored identity loading, and status state.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks to fetch all readings or the latest reading from the backend actor with polling.",
  "frontend/src/index.css": "Sets up Tailwind base styles and custom OKLCH color variables for light and dark themes.",
  "frontend/src/lib/format.ts": "Utility functions for formatting numbers and converting bigint timestamps into readable dates.",
  "frontend/src/lib/runtimeConfig.ts": "Resolves the backend canister ID using multiple fallbacks and caches the result for runtime use.",
  "frontend/src/main.tsx": "Initializes the React app, wrapping it with QueryClientProvider and InternetIdentityProvider.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, fonts, container settings, animations, and dark mode setup.",
  "project_state.json": "Project metadata tracking features, known issues, and pending requests for adding a /status HTTP endpoint."
}